espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2c_reg.h
/**
 * SPDX-FileCopyrightText: 2023-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_I2C_SCL_LOW_PERIOD_REG register
 *  Configures the low level width of the SCL
 *  Clock
 */
#define LP_I2C_SCL_LOW_PERIOD_REG (DR_REG_LP_I2C_BASE + 0x0)
/** LP_I2C_SCL_LOW_PERIOD : R/W; bitpos: [8:0]; default: 0;
 *  Configures the low level width of the SCL Clock.
 *  Measurement unit: i2c_sclk.
 */
#define LP_I2C_SCL_LOW_PERIOD    0x000001FFU
#define LP_I2C_SCL_LOW_PERIOD_M  (LP_I2C_SCL_LOW_PERIOD_V << LP_I2C_SCL_LOW_PERIOD_S)
#define LP_I2C_SCL_LOW_PERIOD_V  0x000001FFU
#define LP_I2C_SCL_LOW_PERIOD_S  0

/** LP_I2C_CTR_REG register
 *  Transmission setting
 */
#define LP_I2C_CTR_REG (DR_REG_LP_I2C_BASE + 0x4)
/** LP_I2C_SAMPLE_SCL_LEVEL : R/W; bitpos: [2]; default: 0;
 *  Configures the sample mode for SDA.
 *  1: Sample SDA data on the SCL low level.
 *
 *  0: Sample SDA data on the SCL high level.
 */
#define LP_I2C_SAMPLE_SCL_LEVEL    (BIT(2))
#define LP_I2C_SAMPLE_SCL_LEVEL_M  (LP_I2C_SAMPLE_SCL_LEVEL_V << LP_I2C_SAMPLE_SCL_LEVEL_S)
#define LP_I2C_SAMPLE_SCL_LEVEL_V  0x00000001U
#define LP_I2C_SAMPLE_SCL_LEVEL_S  2
/** LP_I2C_RX_FULL_ACK_LEVEL : R/W; bitpos: [3]; default: 1;
 *  Configures the ACK value that needs to be sent by master when the rx_fifo_cnt has
 *  reached the threshold.
 */
#define LP_I2C_RX_FULL_ACK_LEVEL    (BIT(3))
#define LP_I2C_RX_FULL_ACK_LEVEL_M  (LP_I2C_RX_FULL_ACK_LEVEL_V << LP_I2C_RX_FULL_ACK_LEVEL_S)
#define LP_I2C_RX_FULL_ACK_LEVEL_V  0x00000001U
#define LP_I2C_RX_FULL_ACK_LEVEL_S  3
/** LP_I2C_TRANS_START : WT; bitpos: [5]; default: 0;
 *  Configures to start sending the data in txfifo for slave.
 *  0: No effect
 *
 *  1: Start
 */
#define LP_I2C_TRANS_START    (BIT(5))
#define LP_I2C_TRANS_START_M  (LP_I2C_TRANS_START_V << LP_I2C_TRANS_START_S)
#define LP_I2C_TRANS_START_V  0x00000001U
#define LP_I2C_TRANS_START_S  5
/** LP_I2C_TX_LSB_FIRST : R/W; bitpos: [6]; default: 0;
 *  Configures to control the sending order for data needing to be sent.
 *  1: send data from the least significant bit,
 *
 *  0: send data from the most significant bit.
 */
#define LP_I2C_TX_LSB_FIRST    (BIT(6))
#define LP_I2C_TX_LSB_FIRST_M  (LP_I2C_TX_LSB_FIRST_V << LP_I2C_TX_LSB_FIRST_S)
#define LP_I2C_TX_LSB_FIRST_V  0x00000001U
#define LP_I2C_TX_LSB_FIRST_S  6
/** LP_I2C_RX_LSB_FIRST : R/W; bitpos: [7]; default: 0;
 *  Configures to control the storage order for received data.
 *  1: receive data from the least significant bit
 *
 *  0: receive data from the most significant bit.
 */
#define LP_I2C_RX_LSB_FIRST    (BIT(7))
#define LP_I2C_RX_LSB_FIRST_M  (LP_I2C_RX_LSB_FIRST_V << LP_I2C_RX_LSB_FIRST_S)
#define LP_I2C_RX_LSB_FIRST_V  0x00000001U
#define LP_I2C_RX_LSB_FIRST_S  7
/** LP_I2C_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  Configures whether to gate clock signal for registers.
 *
 *  0: Force clock on for registers
 *
 *  1: Support clock only when registers are read or written to by software.
 */
#define LP_I2C_CLK_EN    (BIT(8))
#define LP_I2C_CLK_EN_M  (LP_I2C_CLK_EN_V << LP_I2C_CLK_EN_S)
#define LP_I2C_CLK_EN_V  0x00000001U
#define LP_I2C_CLK_EN_S  8
/** LP_I2C_ARBITRATION_EN : R/W; bitpos: [9]; default: 1;
 *  Configures to enable I2C bus arbitration detection.
 *  0: No effect
 *
 *  1: Enable
 */
#define LP_I2C_ARBITRATION_EN    (BIT(9))
#define LP_I2C_ARBITRATION_EN_M  (LP_I2C_ARBITRATION_EN_V << LP_I2C_ARBITRATION_EN_S)
#define LP_I2C_ARBITRATION_EN_V  0x00000001U
#define LP_I2C_ARBITRATION_EN_S  9
/** LP_I2C_FSM_RST : WT; bitpos: [10]; default: 0;
 *  Configures to reset the SCL_FSM.
 *  0: No effect
 *
 *  1: Reset
 */
#define LP_I2C_FSM_RST    (BIT(10))
#define LP_I2C_FSM_RST_M  (LP_I2C_FSM_RST_V << LP_I2C_FSM_RST_S)
#define LP_I2C_FSM_RST_V  0x00000001U
#define LP_I2C_FSM_RST_S  10
/** LP_I2C_CONF_UPGATE : WT; bitpos: [11]; default: 0;
 *  Configures this bit for synchronization
 *  0: No effect
 *
 *  1: Synchronize
 */
#define LP_I2C_CONF_UPGATE    (BIT(11))
#define LP_I2C_CONF_UPGATE_M  (LP_I2C_CONF_UPGATE_V << LP_I2C_CONF_UPGATE_S)
#define LP_I2C_CONF_UPGATE_V  0x00000001U
#define LP_I2C_CONF_UPGATE_S  11

/** LP_I2C_SR_REG register
 *  Describe I2C work status.
 */
#define LP_I2C_SR_REG (DR_REG_LP_I2C_BASE + 0x8)
/** LP_I2C_RESP_REC : RO; bitpos: [0]; default: 0;
 *  Represents the received ACK value in master mode or slave mode.
 *  0: ACK,
 *
 *  1: NACK.
 */
#define LP_I2C_RESP_REC    (BIT(0))
#define LP_I2C_RESP_REC_M  (LP_I2C_RESP_REC_V << LP_I2C_RESP_REC_S)
#define LP_I2C_RESP_REC_V  0x00000001U
#define LP_I2C_RESP_REC_S  0
/** LP_I2C_ARB_LOST : RO; bitpos: [3]; default: 0;
 *  Represents whether the I2C controller loses control of SCL line.
 *  0: No arbitration lost
 *
 *  1: Arbitration lost
 */
#define LP_I2C_ARB_LOST    (BIT(3))
#define LP_I2C_ARB_LOST_M  (LP_I2C_ARB_LOST_V << LP_I2C_ARB_LOST_S)
#define LP_I2C_ARB_LOST_V  0x00000001U
#define LP_I2C_ARB_LOST_S  3
/** LP_I2C_BUS_BUSY : RO; bitpos: [4]; default: 0;
 *  Represents the I2C bus state.
 *  1: The I2C bus is busy transferring data,
 *
 *  0: The I2C bus is in idle state.
 */
#define LP_I2C_BUS_BUSY    (BIT(4))
#define LP_I2C_BUS_BUSY_M  (LP_I2C_BUS_BUSY_V << LP_I2C_BUS_BUSY_S)
#define LP_I2C_BUS_BUSY_V  0x00000001U
#define LP_I2C_BUS_BUSY_S  4
/** LP_I2C_RXFIFO_CNT : RO; bitpos: [12:8]; default: 0;
 *  Represents the number of data bytes to be sent.
 */
#define LP_I2C_RXFIFO_CNT    0x0000001FU
#define LP_I2C_RXFIFO_CNT_M  (LP_I2C_RXFIFO_CNT_V << LP_I2C_RXFIFO_CNT_S)
#define LP_I2C_RXFIFO_CNT_V  0x0000001FU
#define LP_I2C_RXFIFO_CNT_S  8
/** LP_I2C_TXFIFO_CNT : RO; bitpos: [22:18]; default: 0;
 *  Represents the number of data bytes received in RAM.
 */
#define LP_I2C_TXFIFO_CNT    0x0000001FU
#define LP_I2C_TXFIFO_CNT_M  (LP_I2C_TXFIFO_CNT_V << LP_I2C_TXFIFO_CNT_S)
#define LP_I2C_TXFIFO_CNT_V  0x0000001FU
#define LP_I2C_TXFIFO_CNT_S  18
/** LP_I2C_SCL_MAIN_STATE_LAST : RO; bitpos: [26:24]; default: 0;
 *  Represents the states of the I2C module state machine.
 *  0: Idle,
 *
 *  1: Address shift,
 *
 *  2: ACK address,
 *
 *  3: Rx data,
 *
 *  4: Tx data,
 *
 *  5: Send ACK,
 *
 *  6: Wait ACK
 */
#define LP_I2C_SCL_MAIN_STATE_LAST    0x00000007U
#define LP_I2C_SCL_MAIN_STATE_LAST_M  (LP_I2C_SCL_MAIN_STATE_LAST_V << LP_I2C_SCL_MAIN_STATE_LAST_S)
#define LP_I2C_SCL_MAIN_STATE_LAST_V  0x00000007U
#define LP_I2C_SCL_MAIN_STATE_LAST_S  24
/** LP_I2C_SCL_STATE_LAST : RO; bitpos: [30:28]; default: 0;
 *  Represents the states of the state machine used to produce SCL.
 *  0: Idle,
 *
 *  1: Start,
 *
 *  2: Negative edge,
 *
 *  3: Low,
 *
 *  4: Positive edge,
 *
 *  5: High,
 *
 *  6: Stop
 */
#define LP_I2C_SCL_STATE_LAST    0x00000007U
#define LP_I2C_SCL_STATE_LAST_M  (LP_I2C_SCL_STATE_LAST_V << LP_I2C_SCL_STATE_LAST_S)
#define LP_I2C_SCL_STATE_LAST_V  0x00000007U
#define LP_I2C_SCL_STATE_LAST_S  28

/** LP_I2C_TO_REG register
 *  Setting time out control for receiving data.
 */
#define LP_I2C_TO_REG (DR_REG_LP_I2C_BASE + 0xc)
/** LP_I2C_TIME_OUT_VALUE : R/W; bitpos: [4:0]; default: 16;
 *  Configures the timeout threshold period for SCL stucking at high or low level. The
 *  actual period is 2^(reg_time_out_value).
 *  Measurement unit: i2c_sclk.
 */
#define LP_I2C_TIME_OUT_VALUE    0x0000001FU
#define LP_I2C_TIME_OUT_VALUE_M  (LP_I2C_TIME_OUT_VALUE_V << LP_I2C_TIME_OUT_VALUE_S)
#define LP_I2C_TIME_OUT_VALUE_V  0x0000001FU
#define LP_I2C_TIME_OUT_VALUE_S  0
/** LP_I2C_TIME_OUT_EN : R/W; bitpos: [5]; default: 0;
 *  Configures to enable time out control.
 *  0: No effect
 *
 *  1: Enable
 */
#define LP_I2C_TIME_OUT_EN    (BIT(5))
#define LP_I2C_TIME_OUT_EN_M  (LP_I2C_TIME_OUT_EN_V << LP_I2C_TIME_OUT_EN_S)
#define LP_I2C_TIME_OUT_EN_V  0x00000001U
#define LP_I2C_TIME_OUT_EN_S  5

/** LP_I2C_FIFO_ST_REG register
 *  FIFO status register.
 */
#define LP_I2C_FIFO_ST_REG (DR_REG_LP_I2C_BASE + 0x14)
/** LP_I2C_RXFIFO_RADDR : RO; bitpos: [3:0]; default: 0;
 *  Represents the offset address of the APB reading from RXFIFO
 */
#define LP_I2C_RXFIFO_RADDR    0x0000000FU
#define LP_I2C_RXFIFO_RADDR_M  (LP_I2C_RXFIFO_RADDR_V << LP_I2C_RXFIFO_RADDR_S)
#define LP_I2C_RXFIFO_RADDR_V  0x0000000FU
#define LP_I2C_RXFIFO_RADDR_S  0
/** LP_I2C_RXFIFO_WADDR : RO; bitpos: [8:5]; default: 0;
 *  Represents the offset address of i2c module receiving data and writing to RXFIFO.
 */
#define LP_I2C_RXFIFO_WADDR    0x0000000FU
#define LP_I2C_RXFIFO_WADDR_M  (LP_I2C_RXFIFO_WADDR_V << LP_I2C_RXFIFO_WADDR_S)
#define LP_I2C_RXFIFO_WADDR_V  0x0000000FU
#define LP_I2C_RXFIFO_WADDR_S  5
/** LP_I2C_TXFIFO_RADDR : RO; bitpos: [13:10]; default: 0;
 *  Represents the offset address of i2c module reading from TXFIFO.
 */
#define LP_I2C_TXFIFO_RADDR    0x0000000FU
#define LP_I2C_TXFIFO_RADDR_M  (LP_I2C_TXFIFO_RADDR_V << LP_I2C_TXFIFO_RADDR_S)
#define LP_I2C_TXFIFO_RADDR_V  0x0000000FU
#define LP_I2C_TXFIFO_RADDR_S  10
/** LP_I2C_TXFIFO_WADDR : RO; bitpos: [18:15]; default: 0;
 *  Represents the offset address of APB bus writing to TXFIFO.
 */
#define LP_I2C_TXFIFO_WADDR    0x0000000FU
#define LP_I2C_TXFIFO_WADDR_M  (LP_I2C_TXFIFO_WADDR_V << LP_I2C_TXFIFO_WADDR_S)
#define LP_I2C_TXFIFO_WADDR_V  0x0000000FU
#define LP_I2C_TXFIFO_WADDR_S  15

/** LP_I2C_FIFO_CONF_REG register
 *  FIFO configuration register.
 */
#define LP_I2C_FIFO_CONF_REG (DR_REG_LP_I2C_BASE + 0x18)
/** LP_I2C_RXFIFO_WM_THRHD : R/W; bitpos: [3:0]; default: 6;
 *  Configures the water mark threshold of RXFIFO in nonfifo access mode. When
 *  reg_reg_fifo_prt_en is 1 and rx FIFO counter is bigger than
 *  reg_rxfifo_wm_thrhd[3:0], reg_rxfifo_wm_int_raw bit will be valid.
 */
#define LP_I2C_RXFIFO_WM_THRHD    0x0000000FU
#define LP_I2C_RXFIFO_WM_THRHD_M  (LP_I2C_RXFIFO_WM_THRHD_V << LP_I2C_RXFIFO_WM_THRHD_S)
#define LP_I2C_RXFIFO_WM_THRHD_V  0x0000000FU
#define LP_I2C_RXFIFO_WM_THRHD_S  0
/** LP_I2C_TXFIFO_WM_THRHD : R/W; bitpos: [8:5]; default: 2;
 *  Configures the water mark threshold of TXFIFO in nonfifo access mode. When
 *  reg_reg_fifo_prt_en is 1 and tx FIFO counter is smaller than
 *  reg_txfifo_wm_thrhd[3:0], reg_txfifo_wm_int_raw bit will be valid.
 */
#define LP_I2C_TXFIFO_WM_THRHD    0x0000000FU
#define LP_I2C_TXFIFO_WM_THRHD_M  (LP_I2C_TXFIFO_WM_THRHD_V << LP_I2C_TXFIFO_WM_THRHD_S)
#define LP_I2C_TXFIFO_WM_THRHD_V  0x0000000FU
#define LP_I2C_TXFIFO_WM_THRHD_S  5
/** LP_I2C_NONFIFO_EN : R/W; bitpos: [10]; default: 0;
 *  Configures to enable APB nonfifo access.
 */
#define LP_I2C_NONFIFO_EN    (BIT(10))
#define LP_I2C_NONFIFO_EN_M  (LP_I2C_NONFIFO_EN_V << LP_I2C_NONFIFO_EN_S)
#define LP_I2C_NONFIFO_EN_V  0x00000001U
#define LP_I2C_NONFIFO_EN_S  10
/** LP_I2C_RX_FIFO_RST : R/W; bitpos: [12]; default: 0;
 *  Configures to reset RXFIFO.
 *  0: No effect
 *
 *  1: Reset
 */
#define LP_I2C_RX_FIFO_RST    (BIT(12))
#define LP_I2C_RX_FIFO_RST_M  (LP_I2C_RX_FIFO_RST_V << LP_I2C_RX_FIFO_RST_S)
#define LP_I2C_RX_FIFO_RST_V  0x00000001U
#define LP_I2C_RX_FIFO_RST_S  12
/** LP_I2C_TX_FIFO_RST : R/W; bitpos: [13]; default: 0;
 *  Configures to reset TXFIFO.
 *  0: No effect
 *
 *  1: Reset
 */
#define LP_I2C_TX_FIFO_RST    (BIT(13))
#define LP_I2C_TX_FIFO_RST_M  (LP_I2C_TX_FIFO_RST_V << LP_I2C_TX_FIFO_RST_S)
#define LP_I2C_TX_FIFO_RST_V  0x00000001U
#define LP_I2C_TX_FIFO_RST_S  13
/** LP_I2C_FIFO_PRT_EN : R/W; bitpos: [14]; default: 1;
 *  Configures to enable FIFO pointer in non-fifo access mode. This bit controls the
 *  valid bits and the TX/RX FIFO overflow, underflow, full and empty interrupts.
 *  0: No effect
 *
 *  1: Enable
 */
#define LP_I2C_FIFO_PRT_EN    (BIT(14))
#define LP_I2C_FIFO_PRT_EN_M  (LP_I2C_FIFO_PRT_EN_V << LP_I2C_FIFO_PRT_EN_S)
#define LP_I2C_FIFO_PRT_EN_V  0x00000001U
#define LP_I2C_FIFO_PRT_EN_S  14

/** LP_I2C_DATA_REG register
 *  Rx FIFO read data.
 */
#define LP_I2C_DATA_REG (DR_REG_LP_I2C_BASE + 0x1c)
/** LP_I2C_FIFO_RDATA : RO; bitpos: [7:0]; default: 0;
 *  Represents the value of RXFIFO read data.
 */
#define LP_I2C_FIFO_RDATA    0x000000FFU
#define LP_I2C_FIFO_RDATA_M  (LP_I2C_FIFO_RDATA_V << LP_I2C_FIFO_RDATA_S)
#define LP_I2C_FIFO_RDATA_V  0x000000FFU
#define LP_I2C_FIFO_RDATA_S  0

/** LP_I2C_INT_RAW_REG register
 *  Raw interrupt status
 */
#define LP_I2C_INT_RAW_REG (DR_REG_LP_I2C_BASE + 0x20)
/** LP_I2C_RXFIFO_WM_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  The raw interrupt status of I2C_RXFIFO_WM_INT interrupt.
 */
#define LP_I2C_RXFIFO_WM_INT_RAW    (BIT(0))
#define LP_I2C_RXFIFO_WM_INT_RAW_M  (LP_I2C_RXFIFO_WM_INT_RAW_V << LP_I2C_RXFIFO_WM_INT_RAW_S)
#define LP_I2C_RXFIFO_WM_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_WM_INT_RAW_S  0
/** LP_I2C_TXFIFO_WM_INT_RAW : R/SS/WTC; bitpos: [1]; default: 1;
 *  The raw interrupt status of I2C_TXFIFO_WM_INT interrupt.
 */
#define LP_I2C_TXFIFO_WM_INT_RAW    (BIT(1))
#define LP_I2C_TXFIFO_WM_INT_RAW_M  (LP_I2C_TXFIFO_WM_INT_RAW_V << LP_I2C_TXFIFO_WM_INT_RAW_S)
#define LP_I2C_TXFIFO_WM_INT_RAW_V  0x00000001U
#define LP_I2C_TXFIFO_WM_INT_RAW_S  1
/** LP_I2C_RXFIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [2]; default: 0;
 *  The raw interrupt status of I2C_RXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_RXFIFO_OVF_INT_RAW    (BIT(2))
#define LP_I2C_RXFIFO_OVF_INT_RAW_M  (LP_I2C_RXFIFO_OVF_INT_RAW_V << LP_I2C_RXFIFO_OVF_INT_RAW_S)
#define LP_I2C_RXFIFO_OVF_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_OVF_INT_RAW_S  2
/** LP_I2C_END_DETECT_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  The raw interrupt status of the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_END_DETECT_INT_RAW    (BIT(3))
#define LP_I2C_END_DETECT_INT_RAW_M  (LP_I2C_END_DETECT_INT_RAW_V << LP_I2C_END_DETECT_INT_RAW_S)
#define LP_I2C_END_DETECT_INT_RAW_V  0x00000001U
#define LP_I2C_END_DETECT_INT_RAW_S  3
/** LP_I2C_BYTE_TRANS_DONE_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  The raw interrupt status of the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW    (BIT(4))
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_M  (LP_I2C_BYTE_TRANS_DONE_INT_RAW_V << LP_I2C_BYTE_TRANS_DONE_INT_RAW_S)
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_V  0x00000001U
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_S  4
/** LP_I2C_ARBITRATION_LOST_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  The raw interrupt status of the I2C_ARBITRATION_LOST_INT interrupt.
 */
#define LP_I2C_ARBITRATION_LOST_INT_RAW    (BIT(5))
#define LP_I2C_ARBITRATION_LOST_INT_RAW_M  (LP_I2C_ARBITRATION_LOST_INT_RAW_V << LP_I2C_ARBITRATION_LOST_INT_RAW_S)
#define LP_I2C_ARBITRATION_LOST_INT_RAW_V  0x00000001U
#define LP_I2C_ARBITRATION_LOST_INT_RAW_S  5
/** LP_I2C_MST_TXFIFO_UDF_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  The raw interrupt status of I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW    (BIT(6))
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_M  (LP_I2C_MST_TXFIFO_UDF_INT_RAW_V << LP_I2C_MST_TXFIFO_UDF_INT_RAW_S)
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_V  0x00000001U
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_S  6
/** LP_I2C_TRANS_COMPLETE_INT_RAW : R/SS/WTC; bitpos: [7]; default: 0;
 *  The raw interrupt status of the I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_TRANS_COMPLETE_INT_RAW    (BIT(7))
#define LP_I2C_TRANS_COMPLETE_INT_RAW_M  (LP_I2C_TRANS_COMPLETE_INT_RAW_V << LP_I2C_TRANS_COMPLETE_INT_RAW_S)
#define LP_I2C_TRANS_COMPLETE_INT_RAW_V  0x00000001U
#define LP_I2C_TRANS_COMPLETE_INT_RAW_S  7
/** LP_I2C_TIME_OUT_INT_RAW : R/SS/WTC; bitpos: [8]; default: 0;
 *  The raw interrupt status of the I2C_TIME_OUT_INT interrupt.
 */
#define LP_I2C_TIME_OUT_INT_RAW    (BIT(8))
#define LP_I2C_TIME_OUT_INT_RAW_M  (LP_I2C_TIME_OUT_INT_RAW_V << LP_I2C_TIME_OUT_INT_RAW_S)
#define LP_I2C_TIME_OUT_INT_RAW_V  0x00000001U
#define LP_I2C_TIME_OUT_INT_RAW_S  8
/** LP_I2C_TRANS_START_INT_RAW : R/SS/WTC; bitpos: [9]; default: 0;
 *  The raw interrupt status of the I2C_TRANS_START_INT interrupt.
 */
#define LP_I2C_TRANS_START_INT_RAW    (BIT(9))
#define LP_I2C_TRANS_START_INT_RAW_M  (LP_I2C_TRANS_START_INT_RAW_V << LP_I2C_TRANS_START_INT_RAW_S)
#define LP_I2C_TRANS_START_INT_RAW_V  0x00000001U
#define LP_I2C_TRANS_START_INT_RAW_S  9
/** LP_I2C_NACK_INT_RAW : R/SS/WTC; bitpos: [10]; default: 0;
 *  The raw interrupt status of I2C_SLAVE_STRETCH_INT interrupt.
 */
#define LP_I2C_NACK_INT_RAW    (BIT(10))
#define LP_I2C_NACK_INT_RAW_M  (LP_I2C_NACK_INT_RAW_V << LP_I2C_NACK_INT_RAW_S)
#define LP_I2C_NACK_INT_RAW_V  0x00000001U
#define LP_I2C_NACK_INT_RAW_S  10
/** LP_I2C_TXFIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [11]; default: 0;
 *  The raw interrupt status of I2C_TXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_TXFIFO_OVF_INT_RAW    (BIT(11))
#define LP_I2C_TXFIFO_OVF_INT_RAW_M  (LP_I2C_TXFIFO_OVF_INT_RAW_V << LP_I2C_TXFIFO_OVF_INT_RAW_S)
#define LP_I2C_TXFIFO_OVF_INT_RAW_V  0x00000001U
#define LP_I2C_TXFIFO_OVF_INT_RAW_S  11
/** LP_I2C_RXFIFO_UDF_INT_RAW : R/SS/WTC; bitpos: [12]; default: 0;
 *  The raw interrupt status of I2C_RXFIFO_UDF_INT  interrupt.
 */
#define LP_I2C_RXFIFO_UDF_INT_RAW    (BIT(12))
#define LP_I2C_RXFIFO_UDF_INT_RAW_M  (LP_I2C_RXFIFO_UDF_INT_RAW_V << LP_I2C_RXFIFO_UDF_INT_RAW_S)
#define LP_I2C_RXFIFO_UDF_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_UDF_INT_RAW_S  12
/** LP_I2C_SCL_ST_TO_INT_RAW : R/SS/WTC; bitpos: [13]; default: 0;
 *  The raw interrupt status of I2C_SCL_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_ST_TO_INT_RAW    (BIT(13))
#define LP_I2C_SCL_ST_TO_INT_RAW_M  (LP_I2C_SCL_ST_TO_INT_RAW_V << LP_I2C_SCL_ST_TO_INT_RAW_S)
#define LP_I2C_SCL_ST_TO_INT_RAW_V  0x00000001U
#define LP_I2C_SCL_ST_TO_INT_RAW_S  13
/** LP_I2C_SCL_MAIN_ST_TO_INT_RAW : R/SS/WTC; bitpos: [14]; default: 0;
 *  The raw interrupt status of I2C_SCL_MAIN_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW    (BIT(14))
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_M  (LP_I2C_SCL_MAIN_ST_TO_INT_RAW_V << LP_I2C_SCL_MAIN_ST_TO_INT_RAW_S)
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_V  0x00000001U
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_S  14
/** LP_I2C_DET_START_INT_RAW : R/SS/WTC; bitpos: [15]; default: 0;
 *  The raw interrupt status of I2C_DET_START_INT interrupt.
 */
#define LP_I2C_DET_START_INT_RAW    (BIT(15))
#define LP_I2C_DET_START_INT_RAW_M  (LP_I2C_DET_START_INT_RAW_V << LP_I2C_DET_START_INT_RAW_S)
#define LP_I2C_DET_START_INT_RAW_V  0x00000001U
#define LP_I2C_DET_START_INT_RAW_S  15

