espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_i2c_reg.h
/** LP_I2C_INT_CLR_REG register
 *  Interrupt clear bits
 */
#define LP_I2C_INT_CLR_REG (DR_REG_LP_I2C_BASE + 0x24)
/** LP_I2C_RXFIFO_WM_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear I2C_RXFIFO_WM_INT interrupt.
 */
#define LP_I2C_RXFIFO_WM_INT_CLR    (BIT(0))
#define LP_I2C_RXFIFO_WM_INT_CLR_M  (LP_I2C_RXFIFO_WM_INT_CLR_V << LP_I2C_RXFIFO_WM_INT_CLR_S)
#define LP_I2C_RXFIFO_WM_INT_CLR_V  0x00000001U
#define LP_I2C_RXFIFO_WM_INT_CLR_S  0
/** LP_I2C_TXFIFO_WM_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear I2C_TXFIFO_WM_INT interrupt.
 */
#define LP_I2C_TXFIFO_WM_INT_CLR    (BIT(1))
#define LP_I2C_TXFIFO_WM_INT_CLR_M  (LP_I2C_TXFIFO_WM_INT_CLR_V << LP_I2C_TXFIFO_WM_INT_CLR_S)
#define LP_I2C_TXFIFO_WM_INT_CLR_V  0x00000001U
#define LP_I2C_TXFIFO_WM_INT_CLR_S  1
/** LP_I2C_RXFIFO_OVF_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear I2C_RXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_RXFIFO_OVF_INT_CLR    (BIT(2))
#define LP_I2C_RXFIFO_OVF_INT_CLR_M  (LP_I2C_RXFIFO_OVF_INT_CLR_V << LP_I2C_RXFIFO_OVF_INT_CLR_S)
#define LP_I2C_RXFIFO_OVF_INT_CLR_V  0x00000001U
#define LP_I2C_RXFIFO_OVF_INT_CLR_S  2
/** LP_I2C_END_DETECT_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_END_DETECT_INT_CLR    (BIT(3))
#define LP_I2C_END_DETECT_INT_CLR_M  (LP_I2C_END_DETECT_INT_CLR_V << LP_I2C_END_DETECT_INT_CLR_S)
#define LP_I2C_END_DETECT_INT_CLR_V  0x00000001U
#define LP_I2C_END_DETECT_INT_CLR_S  3
/** LP_I2C_BYTE_TRANS_DONE_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_BYTE_TRANS_DONE_INT_CLR    (BIT(4))
#define LP_I2C_BYTE_TRANS_DONE_INT_CLR_M  (LP_I2C_BYTE_TRANS_DONE_INT_CLR_V << LP_I2C_BYTE_TRANS_DONE_INT_CLR_S)
#define LP_I2C_BYTE_TRANS_DONE_INT_CLR_V  0x00000001U
#define LP_I2C_BYTE_TRANS_DONE_INT_CLR_S  4
/** LP_I2C_ARBITRATION_LOST_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear the I2C_ARBITRATION_LOST_INT interrupt.
 */
#define LP_I2C_ARBITRATION_LOST_INT_CLR    (BIT(5))
#define LP_I2C_ARBITRATION_LOST_INT_CLR_M  (LP_I2C_ARBITRATION_LOST_INT_CLR_V << LP_I2C_ARBITRATION_LOST_INT_CLR_S)
#define LP_I2C_ARBITRATION_LOST_INT_CLR_V  0x00000001U
#define LP_I2C_ARBITRATION_LOST_INT_CLR_S  5
/** LP_I2C_MST_TXFIFO_UDF_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_MST_TXFIFO_UDF_INT_CLR    (BIT(6))
#define LP_I2C_MST_TXFIFO_UDF_INT_CLR_M  (LP_I2C_MST_TXFIFO_UDF_INT_CLR_V << LP_I2C_MST_TXFIFO_UDF_INT_CLR_S)
#define LP_I2C_MST_TXFIFO_UDF_INT_CLR_V  0x00000001U
#define LP_I2C_MST_TXFIFO_UDF_INT_CLR_S  6
/** LP_I2C_TRANS_COMPLETE_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Write 1 to clear the I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_TRANS_COMPLETE_INT_CLR    (BIT(7))
#define LP_I2C_TRANS_COMPLETE_INT_CLR_M  (LP_I2C_TRANS_COMPLETE_INT_CLR_V << LP_I2C_TRANS_COMPLETE_INT_CLR_S)
#define LP_I2C_TRANS_COMPLETE_INT_CLR_V  0x00000001U
#define LP_I2C_TRANS_COMPLETE_INT_CLR_S  7
/** LP_I2C_TIME_OUT_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Write 1 to clear the I2C_TIME_OUT_INT interrupt.
 */
#define LP_I2C_TIME_OUT_INT_CLR    (BIT(8))
#define LP_I2C_TIME_OUT_INT_CLR_M  (LP_I2C_TIME_OUT_INT_CLR_V << LP_I2C_TIME_OUT_INT_CLR_S)
#define LP_I2C_TIME_OUT_INT_CLR_V  0x00000001U
#define LP_I2C_TIME_OUT_INT_CLR_S  8
/** LP_I2C_TRANS_START_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Write 1 to clear the I2C_TRANS_START_INT interrupt.
 */
#define LP_I2C_TRANS_START_INT_CLR    (BIT(9))
#define LP_I2C_TRANS_START_INT_CLR_M  (LP_I2C_TRANS_START_INT_CLR_V << LP_I2C_TRANS_START_INT_CLR_S)
#define LP_I2C_TRANS_START_INT_CLR_V  0x00000001U
#define LP_I2C_TRANS_START_INT_CLR_S  9
/** LP_I2C_NACK_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Write 1 to clear I2C_SLAVE_STRETCH_INT interrupt.
 */
#define LP_I2C_NACK_INT_CLR    (BIT(10))
#define LP_I2C_NACK_INT_CLR_M  (LP_I2C_NACK_INT_CLR_V << LP_I2C_NACK_INT_CLR_S)
#define LP_I2C_NACK_INT_CLR_V  0x00000001U
#define LP_I2C_NACK_INT_CLR_S  10
/** LP_I2C_TXFIFO_OVF_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Write 1 to clear I2C_TXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_TXFIFO_OVF_INT_CLR    (BIT(11))
#define LP_I2C_TXFIFO_OVF_INT_CLR_M  (LP_I2C_TXFIFO_OVF_INT_CLR_V << LP_I2C_TXFIFO_OVF_INT_CLR_S)
#define LP_I2C_TXFIFO_OVF_INT_CLR_V  0x00000001U
#define LP_I2C_TXFIFO_OVF_INT_CLR_S  11
/** LP_I2C_RXFIFO_UDF_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Write 1 to clear I2C_RXFIFO_UDF_INT  interrupt.
 */
#define LP_I2C_RXFIFO_UDF_INT_CLR    (BIT(12))
#define LP_I2C_RXFIFO_UDF_INT_CLR_M  (LP_I2C_RXFIFO_UDF_INT_CLR_V << LP_I2C_RXFIFO_UDF_INT_CLR_S)
#define LP_I2C_RXFIFO_UDF_INT_CLR_V  0x00000001U
#define LP_I2C_RXFIFO_UDF_INT_CLR_S  12
/** LP_I2C_SCL_ST_TO_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Write 1 to clear I2C_SCL_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_ST_TO_INT_CLR    (BIT(13))
#define LP_I2C_SCL_ST_TO_INT_CLR_M  (LP_I2C_SCL_ST_TO_INT_CLR_V << LP_I2C_SCL_ST_TO_INT_CLR_S)
#define LP_I2C_SCL_ST_TO_INT_CLR_V  0x00000001U
#define LP_I2C_SCL_ST_TO_INT_CLR_S  13
/** LP_I2C_SCL_MAIN_ST_TO_INT_CLR : WT; bitpos: [14]; default: 0;
 *  Write 1 to clear I2C_SCL_MAIN_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_MAIN_ST_TO_INT_CLR    (BIT(14))
#define LP_I2C_SCL_MAIN_ST_TO_INT_CLR_M  (LP_I2C_SCL_MAIN_ST_TO_INT_CLR_V << LP_I2C_SCL_MAIN_ST_TO_INT_CLR_S)
#define LP_I2C_SCL_MAIN_ST_TO_INT_CLR_V  0x00000001U
#define LP_I2C_SCL_MAIN_ST_TO_INT_CLR_S  14
/** LP_I2C_DET_START_INT_CLR : WT; bitpos: [15]; default: 0;
 *  Write 1 to clear I2C_DET_START_INT interrupt.
 */
#define LP_I2C_DET_START_INT_CLR    (BIT(15))
#define LP_I2C_DET_START_INT_CLR_M  (LP_I2C_DET_START_INT_CLR_V << LP_I2C_DET_START_INT_CLR_S)
#define LP_I2C_DET_START_INT_CLR_V  0x00000001U
#define LP_I2C_DET_START_INT_CLR_S  15

/** LP_I2C_INT_ENA_REG register
 *  Interrupt enable bits
 */
#define LP_I2C_INT_ENA_REG (DR_REG_LP_I2C_BASE + 0x28)
/** LP_I2C_RXFIFO_WM_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to anable I2C_RXFIFO_WM_INT interrupt.
 */
#define LP_I2C_RXFIFO_WM_INT_ENA    (BIT(0))
#define LP_I2C_RXFIFO_WM_INT_ENA_M  (LP_I2C_RXFIFO_WM_INT_ENA_V << LP_I2C_RXFIFO_WM_INT_ENA_S)
#define LP_I2C_RXFIFO_WM_INT_ENA_V  0x00000001U
#define LP_I2C_RXFIFO_WM_INT_ENA_S  0
/** LP_I2C_TXFIFO_WM_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to anable I2C_TXFIFO_WM_INT interrupt.
 */
#define LP_I2C_TXFIFO_WM_INT_ENA    (BIT(1))
#define LP_I2C_TXFIFO_WM_INT_ENA_M  (LP_I2C_TXFIFO_WM_INT_ENA_V << LP_I2C_TXFIFO_WM_INT_ENA_S)
#define LP_I2C_TXFIFO_WM_INT_ENA_V  0x00000001U
#define LP_I2C_TXFIFO_WM_INT_ENA_S  1
/** LP_I2C_RXFIFO_OVF_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to anable I2C_RXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_RXFIFO_OVF_INT_ENA    (BIT(2))
#define LP_I2C_RXFIFO_OVF_INT_ENA_M  (LP_I2C_RXFIFO_OVF_INT_ENA_V << LP_I2C_RXFIFO_OVF_INT_ENA_S)
#define LP_I2C_RXFIFO_OVF_INT_ENA_V  0x00000001U
#define LP_I2C_RXFIFO_OVF_INT_ENA_S  2
/** LP_I2C_END_DETECT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to anable the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_END_DETECT_INT_ENA    (BIT(3))
#define LP_I2C_END_DETECT_INT_ENA_M  (LP_I2C_END_DETECT_INT_ENA_V << LP_I2C_END_DETECT_INT_ENA_S)
#define LP_I2C_END_DETECT_INT_ENA_V  0x00000001U
#define LP_I2C_END_DETECT_INT_ENA_S  3
/** LP_I2C_BYTE_TRANS_DONE_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to anable the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_BYTE_TRANS_DONE_INT_ENA    (BIT(4))
#define LP_I2C_BYTE_TRANS_DONE_INT_ENA_M  (LP_I2C_BYTE_TRANS_DONE_INT_ENA_V << LP_I2C_BYTE_TRANS_DONE_INT_ENA_S)
#define LP_I2C_BYTE_TRANS_DONE_INT_ENA_V  0x00000001U
#define LP_I2C_BYTE_TRANS_DONE_INT_ENA_S  4
/** LP_I2C_ARBITRATION_LOST_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to anable the I2C_ARBITRATION_LOST_INT interrupt.
 */
#define LP_I2C_ARBITRATION_LOST_INT_ENA    (BIT(5))
#define LP_I2C_ARBITRATION_LOST_INT_ENA_M  (LP_I2C_ARBITRATION_LOST_INT_ENA_V << LP_I2C_ARBITRATION_LOST_INT_ENA_S)
#define LP_I2C_ARBITRATION_LOST_INT_ENA_V  0x00000001U
#define LP_I2C_ARBITRATION_LOST_INT_ENA_S  5
/** LP_I2C_MST_TXFIFO_UDF_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to anable I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_MST_TXFIFO_UDF_INT_ENA    (BIT(6))
#define LP_I2C_MST_TXFIFO_UDF_INT_ENA_M  (LP_I2C_MST_TXFIFO_UDF_INT_ENA_V << LP_I2C_MST_TXFIFO_UDF_INT_ENA_S)
#define LP_I2C_MST_TXFIFO_UDF_INT_ENA_V  0x00000001U
#define LP_I2C_MST_TXFIFO_UDF_INT_ENA_S  6
/** LP_I2C_TRANS_COMPLETE_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Write 1 to anable the I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_TRANS_COMPLETE_INT_ENA    (BIT(7))
#define LP_I2C_TRANS_COMPLETE_INT_ENA_M  (LP_I2C_TRANS_COMPLETE_INT_ENA_V << LP_I2C_TRANS_COMPLETE_INT_ENA_S)
#define LP_I2C_TRANS_COMPLETE_INT_ENA_V  0x00000001U
#define LP_I2C_TRANS_COMPLETE_INT_ENA_S  7
/** LP_I2C_TIME_OUT_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  Write 1 to anable the I2C_TIME_OUT_INT interrupt.
 */
#define LP_I2C_TIME_OUT_INT_ENA    (BIT(8))
#define LP_I2C_TIME_OUT_INT_ENA_M  (LP_I2C_TIME_OUT_INT_ENA_V << LP_I2C_TIME_OUT_INT_ENA_S)
#define LP_I2C_TIME_OUT_INT_ENA_V  0x00000001U
#define LP_I2C_TIME_OUT_INT_ENA_S  8
/** LP_I2C_TRANS_START_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  Write 1 to anable the I2C_TRANS_START_INT interrupt.
 */
#define LP_I2C_TRANS_START_INT_ENA    (BIT(9))
#define LP_I2C_TRANS_START_INT_ENA_M  (LP_I2C_TRANS_START_INT_ENA_V << LP_I2C_TRANS_START_INT_ENA_S)
#define LP_I2C_TRANS_START_INT_ENA_V  0x00000001U
#define LP_I2C_TRANS_START_INT_ENA_S  9
/** LP_I2C_NACK_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  Write 1 to anable I2C_SLAVE_STRETCH_INT interrupt.
 */
#define LP_I2C_NACK_INT_ENA    (BIT(10))
#define LP_I2C_NACK_INT_ENA_M  (LP_I2C_NACK_INT_ENA_V << LP_I2C_NACK_INT_ENA_S)
#define LP_I2C_NACK_INT_ENA_V  0x00000001U
#define LP_I2C_NACK_INT_ENA_S  10
/** LP_I2C_TXFIFO_OVF_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  Write 1 to anable I2C_TXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_TXFIFO_OVF_INT_ENA    (BIT(11))
#define LP_I2C_TXFIFO_OVF_INT_ENA_M  (LP_I2C_TXFIFO_OVF_INT_ENA_V << LP_I2C_TXFIFO_OVF_INT_ENA_S)
#define LP_I2C_TXFIFO_OVF_INT_ENA_V  0x00000001U
#define LP_I2C_TXFIFO_OVF_INT_ENA_S  11
/** LP_I2C_RXFIFO_UDF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  Write 1 to anable I2C_RXFIFO_UDF_INT  interrupt.
 */
#define LP_I2C_RXFIFO_UDF_INT_ENA    (BIT(12))
#define LP_I2C_RXFIFO_UDF_INT_ENA_M  (LP_I2C_RXFIFO_UDF_INT_ENA_V << LP_I2C_RXFIFO_UDF_INT_ENA_S)
#define LP_I2C_RXFIFO_UDF_INT_ENA_V  0x00000001U
#define LP_I2C_RXFIFO_UDF_INT_ENA_S  12
/** LP_I2C_SCL_ST_TO_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  Write 1 to anable I2C_SCL_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_ST_TO_INT_ENA    (BIT(13))
#define LP_I2C_SCL_ST_TO_INT_ENA_M  (LP_I2C_SCL_ST_TO_INT_ENA_V << LP_I2C_SCL_ST_TO_INT_ENA_S)
#define LP_I2C_SCL_ST_TO_INT_ENA_V  0x00000001U
#define LP_I2C_SCL_ST_TO_INT_ENA_S  13
/** LP_I2C_SCL_MAIN_ST_TO_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  Write 1 to anable I2C_SCL_MAIN_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_MAIN_ST_TO_INT_ENA    (BIT(14))
#define LP_I2C_SCL_MAIN_ST_TO_INT_ENA_M  (LP_I2C_SCL_MAIN_ST_TO_INT_ENA_V << LP_I2C_SCL_MAIN_ST_TO_INT_ENA_S)
#define LP_I2C_SCL_MAIN_ST_TO_INT_ENA_V  0x00000001U
#define LP_I2C_SCL_MAIN_ST_TO_INT_ENA_S  14
/** LP_I2C_DET_START_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  Write 1 to anable I2C_DET_START_INT interrupt.
 */
#define LP_I2C_DET_START_INT_ENA    (BIT(15))
#define LP_I2C_DET_START_INT_ENA_M  (LP_I2C_DET_START_INT_ENA_V << LP_I2C_DET_START_INT_ENA_S)
#define LP_I2C_DET_START_INT_ENA_V  0x00000001U
#define LP_I2C_DET_START_INT_ENA_S  15

/** LP_I2C_INT_STATUS_REG register
 *  Status of captured I2C communication events
 */
#define LP_I2C_INT_STATUS_REG (DR_REG_LP_I2C_BASE + 0x2c)
/** LP_I2C_RXFIFO_WM_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status status of I2C_RXFIFO_WM_INT interrupt.
 */
#define LP_I2C_RXFIFO_WM_INT_ST    (BIT(0))
#define LP_I2C_RXFIFO_WM_INT_ST_M  (LP_I2C_RXFIFO_WM_INT_ST_V << LP_I2C_RXFIFO_WM_INT_ST_S)
#define LP_I2C_RXFIFO_WM_INT_ST_V  0x00000001U
#define LP_I2C_RXFIFO_WM_INT_ST_S  0
/** LP_I2C_TXFIFO_WM_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status status of I2C_TXFIFO_WM_INT interrupt.
 */
#define LP_I2C_TXFIFO_WM_INT_ST    (BIT(1))
#define LP_I2C_TXFIFO_WM_INT_ST_M  (LP_I2C_TXFIFO_WM_INT_ST_V << LP_I2C_TXFIFO_WM_INT_ST_S)
#define LP_I2C_TXFIFO_WM_INT_ST_V  0x00000001U
#define LP_I2C_TXFIFO_WM_INT_ST_S  1
/** LP_I2C_RXFIFO_OVF_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status status of I2C_RXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_RXFIFO_OVF_INT_ST    (BIT(2))
#define LP_I2C_RXFIFO_OVF_INT_ST_M  (LP_I2C_RXFIFO_OVF_INT_ST_V << LP_I2C_RXFIFO_OVF_INT_ST_S)
#define LP_I2C_RXFIFO_OVF_INT_ST_V  0x00000001U
#define LP_I2C_RXFIFO_OVF_INT_ST_S  2
/** LP_I2C_END_DETECT_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status status of the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_END_DETECT_INT_ST    (BIT(3))
#define LP_I2C_END_DETECT_INT_ST_M  (LP_I2C_END_DETECT_INT_ST_V << LP_I2C_END_DETECT_INT_ST_S)
#define LP_I2C_END_DETECT_INT_ST_V  0x00000001U
#define LP_I2C_END_DETECT_INT_ST_S  3
/** LP_I2C_BYTE_TRANS_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status status of the I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_BYTE_TRANS_DONE_INT_ST    (BIT(4))
#define LP_I2C_BYTE_TRANS_DONE_INT_ST_M  (LP_I2C_BYTE_TRANS_DONE_INT_ST_V << LP_I2C_BYTE_TRANS_DONE_INT_ST_S)
#define LP_I2C_BYTE_TRANS_DONE_INT_ST_V  0x00000001U
#define LP_I2C_BYTE_TRANS_DONE_INT_ST_S  4
/** LP_I2C_ARBITRATION_LOST_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status status of the I2C_ARBITRATION_LOST_INT interrupt.
 */
#define LP_I2C_ARBITRATION_LOST_INT_ST    (BIT(5))
#define LP_I2C_ARBITRATION_LOST_INT_ST_M  (LP_I2C_ARBITRATION_LOST_INT_ST_V << LP_I2C_ARBITRATION_LOST_INT_ST_S)
#define LP_I2C_ARBITRATION_LOST_INT_ST_V  0x00000001U
#define LP_I2C_ARBITRATION_LOST_INT_ST_S  5
/** LP_I2C_MST_TXFIFO_UDF_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status status of I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_MST_TXFIFO_UDF_INT_ST    (BIT(6))
#define LP_I2C_MST_TXFIFO_UDF_INT_ST_M  (LP_I2C_MST_TXFIFO_UDF_INT_ST_V << LP_I2C_MST_TXFIFO_UDF_INT_ST_S)
#define LP_I2C_MST_TXFIFO_UDF_INT_ST_V  0x00000001U
#define LP_I2C_MST_TXFIFO_UDF_INT_ST_S  6
/** LP_I2C_TRANS_COMPLETE_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status status of the I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_TRANS_COMPLETE_INT_ST    (BIT(7))
#define LP_I2C_TRANS_COMPLETE_INT_ST_M  (LP_I2C_TRANS_COMPLETE_INT_ST_V << LP_I2C_TRANS_COMPLETE_INT_ST_S)
#define LP_I2C_TRANS_COMPLETE_INT_ST_V  0x00000001U
#define LP_I2C_TRANS_COMPLETE_INT_ST_S  7
/** LP_I2C_TIME_OUT_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status status of the I2C_TIME_OUT_INT interrupt.
 */
#define LP_I2C_TIME_OUT_INT_ST    (BIT(8))
#define LP_I2C_TIME_OUT_INT_ST_M  (LP_I2C_TIME_OUT_INT_ST_V << LP_I2C_TIME_OUT_INT_ST_S)
#define LP_I2C_TIME_OUT_INT_ST_V  0x00000001U
#define LP_I2C_TIME_OUT_INT_ST_S  8
/** LP_I2C_TRANS_START_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status status of the I2C_TRANS_START_INT interrupt.
 */
#define LP_I2C_TRANS_START_INT_ST    (BIT(9))
#define LP_I2C_TRANS_START_INT_ST_M  (LP_I2C_TRANS_START_INT_ST_V << LP_I2C_TRANS_START_INT_ST_S)
#define LP_I2C_TRANS_START_INT_ST_V  0x00000001U
#define LP_I2C_TRANS_START_INT_ST_S  9
/** LP_I2C_NACK_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status status of I2C_SLAVE_STRETCH_INT interrupt.
 */
#define LP_I2C_NACK_INT_ST    (BIT(10))
#define LP_I2C_NACK_INT_ST_M  (LP_I2C_NACK_INT_ST_V << LP_I2C_NACK_INT_ST_S)
#define LP_I2C_NACK_INT_ST_V  0x00000001U
#define LP_I2C_NACK_INT_ST_S  10
/** LP_I2C_TXFIFO_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status status of I2C_TXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_TXFIFO_OVF_INT_ST    (BIT(11))
#define LP_I2C_TXFIFO_OVF_INT_ST_M  (LP_I2C_TXFIFO_OVF_INT_ST_V << LP_I2C_TXFIFO_OVF_INT_ST_S)
#define LP_I2C_TXFIFO_OVF_INT_ST_V  0x00000001U
#define LP_I2C_TXFIFO_OVF_INT_ST_S  11
/** LP_I2C_RXFIFO_UDF_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status status of I2C_RXFIFO_UDF_INT  interrupt.
 */
#define LP_I2C_RXFIFO_UDF_INT_ST    (BIT(12))
#define LP_I2C_RXFIFO_UDF_INT_ST_M  (LP_I2C_RXFIFO_UDF_INT_ST_V << LP_I2C_RXFIFO_UDF_INT_ST_S)
#define LP_I2C_RXFIFO_UDF_INT_ST_V  0x00000001U
#define LP_I2C_RXFIFO_UDF_INT_ST_S  12
/** LP_I2C_SCL_ST_TO_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked interrupt status status of I2C_SCL_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_ST_TO_INT_ST    (BIT(13))
#define LP_I2C_SCL_ST_TO_INT_ST_M  (LP_I2C_SCL_ST_TO_INT_ST_V << LP_I2C_SCL_ST_TO_INT_ST_S)
#define LP_I2C_SCL_ST_TO_INT_ST_V  0x00000001U
#define LP_I2C_SCL_ST_TO_INT_ST_S  13
/** LP_I2C_SCL_MAIN_ST_TO_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked interrupt status status of I2C_SCL_MAIN_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_MAIN_ST_TO_INT_ST    (BIT(14))
#define LP_I2C_SCL_MAIN_ST_TO_INT_ST_M  (LP_I2C_SCL_MAIN_ST_TO_INT_ST_V << LP_I2C_SCL_MAIN_ST_TO_INT_ST_S)
#define LP_I2C_SCL_MAIN_ST_TO_INT_ST_V  0x00000001U
#define LP_I2C_SCL_MAIN_ST_TO_INT_ST_S  14
/** LP_I2C_DET_START_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked interrupt status status of I2C_DET_START_INT interrupt.
 */
#define LP_I2C_DET_START_INT_ST    (BIT(15))
#define LP_I2C_DET_START_INT_ST_M  (LP_I2C_DET_START_INT_ST_V << LP_I2C_DET_START_INT_ST_S)
#define LP_I2C_DET_START_INT_ST_V  0x00000001U
#define LP_I2C_DET_START_INT_ST_S  15

